{"filename":"public/posts.json","collections":[{"name":"posts","data":[{"title":"Kipyegon: How Kenyan achieved mother of all feats in Tokyo","image":"https://www.dailynews.lk/sites/default/files/styles/node-teaser-default/public/news/2018/07/10/j1.jpg?itok=f1K5atuR","content":"<div class=\"field-item even\" style=\"font-size:18px;\">\r\n\t<p>\r\n\t\tAt least 126 people are now known to have died in floods and landslides triggered by torrential rain in western Japan, says the government.\r\n\t</p>\r\n\t<p>\r\n\t\tIt is the highest death toll caused by rainfall that Japan has seen in more than three decades.\r\n\t</p>\r\n\t<p>\r\n\t\tRescuers are now digging through mud and rubble in a race to find survivors, as dozens are still missing.\r\n\t</p>\r\n\t<p>\r\n\t\tAbout two million people have evacuated the region after rivers burst their banks.\r\n\t</p>\r\n\t<p>\r\n\t\t\"I have asked my family to prepare for the worst,\" 38-year-old Kosuke Kiyohara, who has not heard from his sister and her two sons said.\r\n\t</p>\r\n\t<p>\r\n\t\tPrime Minister Shinzo Abe has also canceled an overseas trip to deal with the flood crisis.\r\n\t</p>\r\n\t<p style=\"text-align:center;\">\r\n\t\t<img alt=\"\" src=\"https://www.dailynews.lk/sites/default/files/u81812/j2.jpg\" style=\"width:624px;height:351px;\" width=\"624\" height=\"351\" />\r\n\t</p>\r\n\t<p style=\"text-align:center;\">\r\n\t\t<img alt=\"\" src=\"https://www.dailynews.lk/sites/default/files/u81812/j3.jpg\" style=\"width:624px;height:351px;\" width=\"624\" height=\"351\" />\r\n\t</p>\r\n\t<p style=\"text-align:center;\">\r\n\t\t<img alt=\"\" src=\"https://www.dailynews.lk/sites/default/files/u81812/j4.jpg\" style=\"width:624px;height:351px;\" width=\"624\" height=\"351\" />\r\n\t</p>\r\n</div>","meta":{"revision":0,"created":1640094518371,"version":0},"$loki":6},{"title":"Thailand cave rescue: Boys \"could be in cave for months\"","image":"https://www.dailynews.lk/sites/default/files/styles/node-teaser-default/public/news/2018/07/03/p06cpwh2.jpg?itok=iQLvnqFH","content":"<div class=\"field-item even\" style=\"font-size: 18px\"> <img alt=\"\" src=\"https://www.dailynews.lk/sites/default/files/styles/node-teaser-default/public/news/2018/07/03/p06cpwh2.jpg?itok=iQLvnqFH\" style=\"width: 624px; height: 351px;\" width=\"624\" height=\"351\"> <p>Twelve boys and their football coach trapped in a Thai cave have been found alive but will need learn to dive or wait months for flooding to recede before they can get out, the army says.</p> <p>The group had been missing for nine days before they were found by divers late on Monday on a small dry ledge.</p> <p>Rescuers are now battling rising water to bring more supplies to the group.</p> <p>They may need to have food sent in for at least the next four months, according to the military.</p> <p>How were they found?</p> <p>Two British rescuer divers who had flown over to join the search operation found the boys on Monday night.</p> <p>The boys are seen by torchlight sitting on a ledge above water, responding to the divers that all 13 were there and that they were very hungry.</p> <p>They ask how long they have been underground and whether they can leave now. The divers tell them they have to wait, but say people will come back for them.</p> <p>One boy replies: \"Oh. See you tomorrow.\"</p> <p>The search for the group had gripped the nation as it was unclear where they were or whether they even were still alive.</p> <p>Families of the missing group were ecstatic at news of the rescue.</p> <p>How can they get out?</p> <p>The Tham Luang cave complex in Chiang Rai in northern Thailand is regularly flooded during the rainy season which lasts until September or October.</p> <p>If the children are to be brought out before then, they will have to learn basic diving skills.</p> <p>But experts have cautioned that taking inexperienced divers through the dangerous corridors of muddy, zero-visibility waters would be a very dangerous operation.</p> <p>Attempts to pump the water levels lower have so far not been successful.</p> <p>If they are to wait until the water recedes by itself, it would mean the boys will have to stay in the cave for months and have to be continuously supplied with food and assistance.</p> <p>Doctors will go in to carry out medical checks in the coming days to establish their condition and treat possible injuries.</p> <p>Who are they?</p> <p>The 12 boys are all members of a local football team, the youngest of them only aged 11.</p> <p>The 25-year old coach who got trapped with them is known to have taken them on occasional excursions and field trips.</p> <p>Tinnakorn Boonpiem, whose 12-year-old son Mongkol is among the 13, told AFP news agency near the caves she was \"so glad\" to hear they were safe.</p> <p>\"I want to him to be physically and mentally fit,\" she said.</p> <p>\"I'm so happy I can't put it into words,\" another relative of one of one of the group told reporters as tears of joy streamed down his cheeks.</p> </div>","meta":{"revision":0,"created":1640094838965,"version":0},"$loki":7},{"title":"Maryland shooting: Five killed in 'targeted' attack on US newspaper","image":"https://www.dailynews.lk/sites/default/files/styles/node-teaser-default/public/news/2018/06/29/capitalgazetteannapolisshooting_062818getty.jpg?itok=iyCg4HsJ","content":"<div class=\"field-item even\" style=\"font-size:18px;\">\r\n\t<img src=\"https://www.dailynews.lk/sites/default/files/styles/node-teaser-default/public/news/2018/06/29/capitalgazetteannapolisshooting_062818getty.jpg?itok=iyCg4HsJ\" />\r\n\t<p>\r\n\t\tA gunman has opened fire at a local newspaper office in Maryland, killing five people and injuring others in what police said was a \"targeted attack\".\r\n\t</p>\r\n\t<p>\r\n\t\tStaff at the Capital Gazette in Annapolis said the attacker, armed with a shotgun and smoke grenades, shot through a glass door into the newsroom.\r\n\t</p>\r\n\t<p>\r\n\t\tUS media have named a suspect held by police as Jarrod Ramos, who is reported to have unsuccessfully sued the newspaper group in 2012 for defamation.\r\n\t</p>\r\n\t<p>\r\n\t\tPolice have not confirmed a motive.\r\n\t</p>\r\n\t<p>\r\n\t\tThey said a white male suspect in his late 30s was taken into custody at the scene of the shooting and was being questioned.\r\n\t</p>\r\n\t<p>\r\n\t\tInvestigators were said to be looking into \"violent\" threats that had been made against the Capital Gazette via social media.\r\n\t</p>\r\n\t<p>\r\n\t\t\"This was a targeted attack on the Capital Gazette,\" said William Krampf, deputy chief of Anne Arundel County Police. He added that the gunman \"entered the building with a shotgun and looked for his victims as he walked through the lower level\".\r\n\t</p>\r\n\t<p>\r\n\t\tCounty executive Steve Schuh told CNN that the suspect was hiding under a desk in the building when police officers arrived \"within 60 seconds\" of receiving news of the incident. He said there was \"no exchange of fire\".\r\n\t</p>\r\n\t<p>\r\n\t\tThe Capital Gazette publishes several local newspapers, including a daily called The Capital, which has a history dating back to 1884. It is owned by the Baltimore Sun Media Group.\r\n\t</p>\r\n\t<p>\r\n\t\tThe Baltimore Sun reported that police gathered outside Ramos' house on Thursday after the attack. It said the alleged suspect has a \"long-running feud\" with The Capital over a 2011 report on a criminal harassment case against him.\r\n\t</p>\r\n\t<p>\r\n\t\tThe victims have been identified by police. They are:\r\n\t</p>\r\n\t<p>\r\n\t\tWendi Winters, 65, reporter<br />\r\nRebecca Smith, 34, sales assistant<br />\r\nRobert Hiaasen, 59, editor<br />\r\nGerald Fischman, 61, editorial writer<br />\r\nJohn McNamara, 56, reporter and editor\r\n\t</p>\r\n\t<p>\r\n\t\tSpeaking to reporters, Krampf said an item \"we believed to be an explosive device\" had been found at the premises and destroyed. He said it turned out to be a smoke bomb.\r\n\t</p>\r\n\t<p>\r\n\t\tHe added that more than 170 people had been escorted safely from the building, which houses other businesses.\r\n\t</p>\r\n</div>","meta":{"revision":0,"created":1640094893046,"version":0},"$loki":8},{"title":"US border agents halt migrant family prosecutions","image":"https://www.dailynews.lk/sites/default/files/news/2018/06/26/_102196904_tv047655697_0.png","content":"<div class=\"field-item even\" style=\"font-size: 18px\"> <p>A US border security chief says he has temporarily stopped launching criminal prosecutions of migrants who illegally enter the country with children.</p> <p>Customs and Border Protection (CBP) Commissioner Kevin McAleenan told reporters in Texas the prosecution referrals were suspended last week. He said it followed an order last week by President Donald Trump calling for an end to migrant family separations.</p> <p>But Trump had suggested the families would instead be detained together.</p> <p>The Republican president bowed to public pressure last Wednesday, signing his executive order to \"keep families together\" in migrant detentions.</p> <p>McAleenan maintained that the Trump administration's \"zero tolerance\" tactics were still in effect, although the commissioner's guidance to his agents largely leaves the policy in limbo.</p> <p>The CBP chief said parents cannot be prosecuted if US officials no longer intend to separate them from their children, who are legally not allowed to be kept in adult detention facilities.</p> <p>He said his agency and the Department of Justice must figure out how to prosecute the parents without splitting them from their children, the Associated Press news agency reported.</p> <p>The border official's decision paves the way for US immigration enforcement to revert largely to the approach under the Obama administration. It means US border agents who stop undocumented adult migrants accompanied by children will hand them a court summons and allow them to go on their way, rather than hold them in a detention facility.</p> <p>President Trump repeatedly lamented this \"catch and release\" policy before his administration began in April criminally prosecuting adult migrants and holding their children separately to deter border crossings.</p> <p>On Monday, White House press secretary Sarah Sanders said the reality was that the US did not have the space to hold all the undocumented families coming across the US-Mexico border.</p> <p>\"We're not changing the policy,\" she told reporters. \"We're simply out of resources.\"</p> <p>The Pentagon confirmed on Monday that two Texas military bases will be used as temporary camps to house the immigrants.</p> <p>But Defence Secretary Jim Mattis did not specify whether the facilities - Fort Bliss and Goodfellow Air Force Base - would house migrant families together. US media earlier reported that one of the bases would be used to house migrant families and the other would shelter undocumented children who enter the US unaccompanied by an adult. Meanwhile, US Attorney General Jeff Sessions talked tough on immigration at a school police officers' conference in Reno, Nevada, on Monday.</p> <p>America's top law official said that refusing to prosecute adults who illegally enter the US \"would be a disservice to the people of this country\", reports the New York Times.</p> <p>He told the audience that lax border enforcement would \"encourage more adults to bring more children illegally\".</p> <p>However, he also said the Trump administration would \"do everything in our power to avoid separating families\".</p> <p><strong>What's the latest on migrant families? </strong></p> <p>The government has yet to reunite parents with more than 2,000 children who have been taken away since last month and sent to holding cells, converted warehouses, desert tents or foster care around the US.</p> <p>The American Civil Liberties Union (ACLU) sought a federal court injunction in San Diego, California, on Monday to stop the administration from separating undocumented immigrant parents from their children.</p> <p>It said that Trump's order to end separations contained \"loopholes\".</p> <p>Court papers filed by the ACLU contained numerous accounts of parents unable to locate or communicate with their children after they were separated by border officials.</p> </div>","meta":{"revision":0,"created":1640094923336,"version":0},"$loki":9},{"title":"Putin set to be inaugurated for fourth term as president of Russia","image":"https://www.dailynews.lk/sites/default/files/news/2018/05/07/5aac372092c0691c008b47d8-750-563.jpg","content":"<div class=\"field-item even\" style=\"font-size: 18px\"> <p>Vladimir Putin is due to be sworn in for a fourth term as president of Russia on Monday after winning the election in March.</p> <p>He has been in power for 18 years, whether as President or Prime Minister, and opponents have likened his tenure to the reign of a tsar, or emperor.</p> <p>Riot police confronted protesters against his rule in Moscow and other Russian cities on Saturday.</p> <p>There have been fears of new unrest on Monday as he takes office.</p> <p>The inauguration at the Kremlin in Moscow is likely to be lower-key than in 2012, AFP news agency reports.</p> <p>Putin is only expected to meet volunteers who took part in his election campaign, the agency says.</p> <p><strong>Why were there protests?</strong></p> <p>More than 1,000 arrests are said to have been made in 19 cities across Russia on Saturday, nearly half of them in Moscow.</p> <p>Putin was re-elected president with more than 76% of the vote, his best ever election performance, but widespread irregularities were reported by some international observers. Allegations of ballot-rigging had dogged previous elections too.</p> <p>The country's best-known opposition leader, Alexei Navalny, was barred from standing against Mr Putin, on grounds of a conviction for embezzlement which he denies and alleges was politically motivated.</p> <p>Navalny was arrested briefly as he tried to join Saturday's unauthorised protest rally in Moscow under the slogan \"He's not our tsar\".</p> <p>Domestic opponents accuse Mr Putin of undermining democracy in Russia - a policy dubbed \"managed democracy\" - to keep genuine opposition parties out of parliament and ensure that he and his allies retain power indefinitely.</p> <p><strong>Could Putin just go on and on?</strong></p> <p>First elected president in 2000, Putin renewed his four-year term in 2004 before stepping aside in 2008 to serve as prime minister under his protege, Dmitry Medvedev, because by law he could only serve two consecutive terms.</p> <p>Few doubted who was really in charge and in 2012 Putin returned as president, this time for a term of six years.</p> <p>If and when he reaches the end of his fourth term in 2024, the 65-year-old will have been in power for nearly a quarter of a century.</p> <p>That would still fall short of Soviet dictator Joseph Stalin's 31 years in power or, indeed, the reigns of some Russian tsars such as Alexander II (26 years) and Nicholas I (30 years).</p> <ul> <li>1952:&nbsp;Born 7 October in Leningrad (now St Petersburg), Russia's second city, studies law and joins KGB secret police, serving as spy in communist East Germany</li> <li>1990s:&nbsp;After serving as top aide to mayor of St Petersburg, enters Boris Yeltsin's Kremlin in 1997, where he is made chief of the FSB (the KGB's successor)</li> <li>1999:&nbsp;Appointed prime minister, becomes acting president upon Yeltsin's resignation</li> <li>2000:&nbsp;Elected president and serves two four-year terms</li> <li>2008:&nbsp;Barred from running for a third consecutive term, stuns analysts by returning to post of prime minister while his protege Dmitry Medvedev becomes president</li> <li>2012:&nbsp;Re-elected president and for term of six years, under new law</li> <li>2018:&nbsp;Re-elected for fourth term</li> </ul> <p><strong>How has Russia changed under Putin?</strong></p> <p>Ordinary Russians welcomed the stability associated with Putin's early years in office when inflation was reined in and basic state functions like the welfare system were shored up.</p> <p>Separatist violence in the North Caucasus which had plagued the administration of Putin's predecessor, the late Boris Yeltsin, was finally brought to a bloody end.</p> <p>As prosperity grew, fuelled by oil and gas revenue, Putin oversaw an increase in state power, rolling back independent media as well as political freedoms.</p> <p>His decision to annex Crimea from Ukraine in 2014 sparked one of the biggest international crises since the Cold War, incurring Western sanctions which continue to this day.</p> <p>Russia's alleged interference in the 2016 US presidential election soured international relations even further, while this year saw Putin accused by the UK of responsibility for a nerve agent attack on its soil - allegations denied by Moscow.</p> <p>Political analyst Dmitry Oreshkin told AFP Mr Putin's approach to the international community would have to change over his new term.</p> <p>\"Russia hasn't been so isolated since the Soviet war in Afghanistan,\" he said.</p> <p>\"Now his [Putin's] task isn't to bring any new lands to Russia but to force the world to consider Russia's interests and accept its previous conquests,\" Oreshkin added.</p> </div>","meta":{"revision":0,"created":1640094964448,"version":0},"$loki":10},{"title":"Methane ice dunes found on Pluto by NASA spacecraft","image":"https://www.dailynews.lk/sites/default/files/news/2018/06/01/_101830883_f54f60cc-a294-47c8-8214-ce7063f83463.jpg","content":"<div class=\"field-item even\" style=\"font-size: 18px\"><p>&nbsp;</p> <div>Scientists say they have found evidence of dunes of frozen methane on Pluto.</div> <div>&nbsp;</div> <div>The research, which is published in the journal Science, suggests that the distant world is more dynamic than previously thought.</div> <div>&nbsp;</div> <div>Pluto's atmosphere was believed to be too thin to create the features familiar in deserts on Earth.</div> <div>&nbsp;</div> <div>The findings come from analysis of the startling images sent back by Nasa's New Horizons mission, which flew close to Pluto in July 2015.</div> <div>&nbsp;</div> <div>After an epic trek through the Solar System that took nearly a decade, New Horizons sped by at a speed of 58,536 km/h (36,373 mph), gathering data as it passed.</div> <div>&nbsp;</div> <div>In their study, the researchers explain how they studied pictures of a plain known as Sputnik Planitia, parts of which are covered with what look like fields of dunes.</div> <div>&nbsp;</div> <div>They are lying close to a range of mountains of water ice 5km high.</div> <div>&nbsp;</div> <div>The scientists conclude that the dunes are 0.4-1km apart and that they are made up of particles of methane ice between 200-300 micrometers in diameter - roughly the size of grains of sand.</div> <div>The paper's lead author is Dr Matt Telfer, a physical geographer at the University of Plymouth told \"We can't see individual grains but what we are able to identify dunes, and characterise their basic physical parameters, and the density of the atmosphere that they've been formed under.</div> <div>&nbsp;</div> <div>\"And we can measure some basic things like how far apart they are spaced, and have an estimate at least of the wind speeds that are forming them.</div> <div>&nbsp;</div> <div>\"We can feed all that back into a physical model and from that deduce what the size of the grains must be.\"</div> <div>&nbsp;</div> <div>To be able to form, dunes need an atmosphere dense enough to make wind transport possible, a supply of dry particles, and a mechanism that lifts particles off the ground.</div> <div>&nbsp;</div> <div>At first sight, none of those conditions seem to be met on Pluto.</div> <div>&nbsp;</div> <div>But Dr Telfer and his colleagues calculate that the dunes may be in one of the windiest areas of the Pluto with wind speeds reaching up to 10m/sec - enough to keep particles moving.The wind is generated as air flows downhill from the neighbouring mountains and also as frozen material sublimates - or turns directly into gas.</div> <div>&nbsp;</div> <div>They believe that the dunes are composed of grains of methane, and maybe of nitrogen as well, and that a \"reservoir\" of methane may exist in the snowpack of the mountains.</div> </div>","meta":{"revision":0,"created":1640094997520,"version":0},"$loki":11},{"title":"Supreme Court rejects NI abortion law case","image":"https://www.dailynews.lk/sites/default/files/news/2018/06/07/_101916767_scourt3.jpg","content":"<div class=\"field-item even\" style=\"font-size: 18px\"><div>&nbsp;</div> <div>Human rights campaigners have lost a Supreme Court appeal over the legality of Northern Ireland's abortion law.</div> <div>&nbsp;</div> <div>The court dismissed an appeal brought by the Northern Ireland Human Rights Commission (NIHRC).</div> <div>&nbsp;</div> <div>But a majority of judges said the existing law was incompatible with human rights law in cases of fatal foetal abnormality and sexual crime.</div> <div>&nbsp;</div> <div>Unlike other parts of the UK, the 1967 Abortion Act does not extend to Northern Ireland.</div> <div>&nbsp;</div> <div>Currently, a termination is only permitted in Northern Ireland if a woman's life is at risk or if there is a risk of permanent and serious damage to her mental or physical health.</div> <div>&nbsp;</div> <div><strong>'Inhuman' treatment?</strong></div> <div>&nbsp;</div> <div>The commission lost on the issue of whether they had the required standing to bring the case, and analysts suggest the defeat came because of a technical legal point.</div> <div>&nbsp;</div> <div>The Supreme Court judges said it would have required the case to have been brought by a woman who was pregnant as a result of sexual crime or who was carrying a foetus with a fatal abnormality.</div> <div>&nbsp;</div> <div>A fatal foetal abnormality diagnosis means doctors believe an unborn child has a terminal condition and will die in the womb or shortly after birth, although anti-abortion campaigners have argued that terminally-ill babies \"can and do defy the odds\".</div> <div>&nbsp;</div> <div>As a result, the judges did not make a formal declaration of incompatibility, which would normally lead to a change in the law.</div> <div>&nbsp;</div> <div>The ruling comes just weeks after the Republic of Ireland voted decisively in a referendum to reform the country's strict abortion laws, which had effectively banned all terminations.</div> <div>&nbsp;</div> <div>The referendum reignited a debate about Northern Ireland's law, with some calling for reform while others - including the biggest party, the Democratic Unionist Party - remain opposed to changing the law.</div> <div>&nbsp;</div> <div>The NICHR had argued that the current law subjects women to \"inhuman and degrading\" treatment, causing \"physical and mental torture,\" in violation of the European Convention on Human Rights (ECHR).</div> </div>","meta":{"revision":0,"created":1640095024628,"version":0},"$loki":12},{"title":"Cambridge Analytica: Facebook data-harvest firm to shut","image":"https://www.dailynews.lk/sites/default/files/news/2018/05/03/download-%281%29.png","content":"<div class=\"field-item even\" style=\"font-size: 18px\"><p>Cambridge Analytica, the political consultancy at the centre of the Facebook data-sharing scandal, is shutting down.</p> <p>The firm was accused of improperly obtaining personal information on behalf of political clients.</p> <p>According to Facebook, data about up to 87 million of its members was harvested by a quiz app and then passed on to the political consultancy.</p> <p>The social network said its own probe into the matter would continue.</p> <p>\"This doesn't change our commitment and determination to understand exactly what happened and make sure it doesn't happen again,\" said a spokesman.</p> <p>\"We are continuing with our investigation in cooperation with the relevant authorities.\"</p> <p>What are the accusations against Cambridge Analytica?</p> <p>The company has been accused of using the personal data of millions of Facebook users to sway the outcome of the US 2016 presidential election and the UK Brexit referendum.</p> <p>In March, Channel 4 aired undercover footage of Cambridge Analytica's CEO, Alexander Nix, giving examples of how the firm could swing elections around the world with underhand tactics such as smear campaigns and honey traps.</p> <p>The UK-based company, which denies any wrongdoing, has an extensive record of working abroad on many election campaigns, including in Italy, Kenya and Nigeria.</p> <p>Why does it is say it is shutting?</p> <p>Clarence Mitchell, a spokesman for Cambridge Analytica, referred the BBC to a&nbsp;statement on the firm's website.</p> <div id=\"block-inject-1\" class=\"block-inject block-inject-1\"><div id=\"block-block-38\" class=\"block block-block clearfix\"> <p>\"Over the past several months, Cambridge Analytica has been the subject of numerous unfounded accusations and, despite the company's efforts to correct the record, has been vilified for activities that are not only legal, but also widely accepted as a standard component of online advertising in both the political and commercial arenas,\" it said.</p> <p>\"Despite Cambridge Analytica's unwavering confidence that its employees have acted ethically and lawfully... the siege of media coverage has driven away virtually all of the company's customers and suppliers.</p> <p>\"As a result, it has been determined that it is no longer viable to continue operating the business.\"</p> <p>The statement added that its parent company SCL Elections was also commencing bankruptcy proceedings.</p> <p>The sting in the tail</p> <p>When the news of Cambridge Analytica's demise broke here at Facebook's F8 developer conference, it is safe to say few tears were shed.</p> <p>The scandal over data misuse has been a crisis not just for Facebook but for the thousands of external developers whose access to data has been curbed in response to the affair.</p> <p>But if they were tempted to celebrate there was a sting in the tail in the political consultancy's statement. It claimed that what it did was not only legal but was standard practice in the world of online advertising.</p> <p>That rang true to some people in this world and there may be more evidence of such practices as Facebook continues its audit of apps.</p> <p>Cambridge Analytica may be gone but as more stones are lifted there may be more unpleasant surprises to come about the use and misuse of personal data.</p> </div>","meta":{"revision":0,"created":1640095052971,"version":0},"$loki":13}],"idIndex":null,"binaryIndices":{},"constraints":null,"uniqueNames":[],"transforms":{},"objType":"posts","dirty":false,"cachedIndex":null,"cachedBinaryIndex":null,"cachedData":null,"adaptiveBinaryIndices":true,"transactional":false,"cloneObjects":false,"cloneMethod":"parse-stringify","asyncListeners":false,"disableMeta":false,"disableChangesApi":true,"disableDeltaChangesApi":true,"autoupdate":false,"serializableIndices":true,"disableFreeze":true,"ttl":null,"maxId":13,"DynamicViews":[],"events":{"insert":[],"update":[],"pre-insert":[],"pre-update":[],"close":[],"flushbuffer":[],"error":[],"delete":[null],"warning":[null]},"changes":[],"dirtyIds":[]}],"databaseVersion":1.5,"engineVersion":1.5,"autosave":false,"autosaveInterval":5000,"autosaveHandle":null,"throttledSaves":true,"options":{"persistenceMethod":"fs","serializationMethod":"normal","destructureDelimiter":"$<\n"},"persistenceMethod":"fs","persistenceAdapter":null,"verbose":false,"events":{"init":[null],"loaded":[],"flushChanges":[],"close":[],"changes":[],"warning":[]},"ENV":"NODEJS"}